In [1]:
import pandas as pd
import numpy as np
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)

In [4]:
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10,6))
np.set_printoptions(precision=4, suppress=True)

In [5]:
#Handling missing data

In [6]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
#Filtering out missing data

In [10]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [13]:
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [14]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA], [NA,NA,NA],[NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [28]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286  1.349742  0.069877
3  0.246674 -0.011862  1.004812
4  1.327195 -0.919262 -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [29]:
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -1.541996       NaN       NaN
1  0.286350       NaN       NaN
2  0.331286       NaN  0.069877
3  0.246674       NaN  1.004812
4  1.327195 -0.919262 -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [30]:
df.dropna()

          0         1         2
4  1.327195 -0.919262 -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [34]:
df.dropna(thresh=2)

          0         1         2
2  0.331286       NaN  0.069877
3  0.246674       NaN  1.004812
4  1.327195 -0.919262 -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [35]:
#Filling in Missing data

In [36]:
df

          0         1         2
0 -1.541996       NaN       NaN
1  0.286350       NaN       NaN
2  0.331286       NaN  0.069877
3  0.246674       NaN  1.004812
4  1.327195 -0.919262 -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [37]:
df.fillna(0)

          0         1         2
0 -1.541996  0.000000  0.000000
1  0.286350  0.000000  0.000000
2  0.331286  0.000000  0.069877
3  0.246674  0.000000  1.004812
4  1.327195 -0.919262 -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [38]:
df

          0         1         2
0 -1.541996       NaN       NaN
1  0.286350       NaN       NaN
2  0.331286       NaN  0.069877
3  0.246674       NaN  1.004812
4  1.327195 -0.919262 -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [39]:
df.fillna({1: 0.5, 2:0})

          0         1         2
0 -1.541996  0.500000  0.000000
1  0.286350  0.500000  0.000000
2  0.331286  0.500000  0.069877
3  0.246674  0.500000  1.004812
4  1.327195 -0.919262 -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [40]:
df.fillna(0, inplace=True)

In [41]:
df

          0         1         2
0 -1.541996  0.000000  0.000000
1  0.286350  0.000000  0.000000
2  0.331286  0.000000  0.069877
3  0.246674  0.000000  1.004812
4  1.327195 -0.919262 -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [57]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0 -0.289436 -0.734297 -0.728505
1  0.838775  0.266893  0.721194
2  0.910983       NaN -1.413416
3  1.296608       NaN  1.127481
4 -0.568363       NaN       NaN
5 -1.168634       NaN       NaN

In [60]:
df.fillna(method = 'ffill')
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.289436 -0.734297 -0.728505
1  0.838775  0.266893  0.721194
2  0.910983  0.266893 -1.413416
3  1.296608  0.266893  1.127481
4 -0.568363       NaN  1.127481
5 -1.168634       NaN  1.127481

In [62]:
data = pd.Series([1.,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [64]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [65]:
#Removing Duplicates

In [66]:
data = pd.DataFrame({'k1': ['one','two'] * 3 + ['two'], 'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [67]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [68]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [71]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [72]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [73]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [74]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [75]:
#transforming data using a lambda function

In [76]:
data = pd.DataFrame({'food': ['bacon','pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [77]:
meat_to_animal={'bacon' : 'pig',
               'pulled pork': 'pig',
               'pastrami': 'cow',
               'corned beef': 'cow',
               'honey ham': 'pig',
               'nova lox': 'salmon'}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [78]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [79]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [80]:
data['food']

0          bacon
1    pulled pork
2          bacon
3       Pastrami
4    corned beef
5          Bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [84]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [85]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [86]:
#Replacing values inplace of missing values

In [87]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [88]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [89]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [90]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [91]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [92]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [93]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [94]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [95]:
#Renaming Axis Indexes

In [103]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index = ['Ohio', 'Colorado', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [116]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [119]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [120]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [121]:
data.rename(index={'OHIO': 'INDIANA'},
           columns = {'three': 'peekanoo'})

         one  two  peekanoo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [122]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [123]:
data.rename(index={'OHIO': 'INDIANA'}, inplace = True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [124]:
#binning or bucketizing for continuous variables

In [125]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [126]:
bins=[18,25,35,60,100]
cats=pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [127]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [128]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [129]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [131]:
pd.cut(ages, [18, 26,36,61,100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [132]:
pd.value_counts(pd.cut(ages, [18, 26,36,61,100], right=False))

[18, 26)     5
[36, 61)     3
[26, 36)     3
[61, 100)    1
dtype: int64

In [134]:
group_names=['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
m = pd.cut(ages, bins, labels=group_names)

In [135]:
m

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [136]:
data=np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.26, 0.49], (0.019, 0.26], (0.49, 0.73], (0.73, 0.96], (0.73, 0.96], ..., (0.49, 0.73], (0.26, 0.49], (0.26, 0.49], (0.73, 0.96], (0.73, 0.96]]
Length: 20
Categories (4, interval[float64]): [(0.019, 0.26] < (0.26, 0.49] < (0.49, 0.73] < (0.73, 0.96]]

In [138]:
data = np.random.randn(1000)  #normal distributed
cats = pd.qcut(data, 4)  #cut into quartiles
cats

[(-0.671, -0.0569], (-3.4, -0.671], (-0.0569, 0.566], (0.566, 3.928], (-0.671, -0.0569], ..., (-0.0569, 0.566], (-0.671, -0.0569], (-0.0569, 0.566], (-0.671, -0.0569], (-0.671, -0.0569]]
Length: 1000
Categories (4, interval[float64]): [(-3.4, -0.671] < (-0.671, -0.0569] < (-0.0569, 0.566] < (0.566, 3.928]]

In [139]:
pd.value_counts(cats)

(0.566, 3.928]       250
(-0.0569, 0.566]     250
(-0.671, -0.0569]    250
(-3.4, -0.671]       250
dtype: int64

In [140]:
pd.qcut(data, [0,0.1,0.5,0.9,1.])

[(-1.191, -0.0569], (-3.4, -1.191], (-0.0569, 1.246], (-0.0569, 1.246], (-1.191, -0.0569], ..., (-0.0569, 1.246], (-1.191, -0.0569], (-0.0569, 1.246], (-1.191, -0.0569], (-1.191, -0.0569]]
Length: 1000
Categories (4, interval[float64]): [(-3.4, -1.191] < (-1.191, -0.0569] < (-0.0569, 1.246] < (1.246, 3.928]]

In [141]:
#filter out the outliers

In [142]:
np.random.randn(1000,4)

array([[ 0.3035, -0.8896, -0.1733,  0.6433],
       [-1.254 ,  0.1172,  0.8665,  1.0795],
       [-0.3975,  1.4875,  0.558 ,  0.6144],
       ...,
       [-0.5215,  0.5355, -0.6251, -0.6324],
       [-0.1542,  0.6405,  0.3659, -0.7412],
       [-0.3961,  2.0258,  1.4405,  2.2287]])

In [143]:
data=pd.DataFrame(np.random.randn(1000,4))
data.head()

          0         1         2         3
0 -0.609849  1.266552 -0.382492 -1.762123
1  0.595926  1.200999  0.154083 -0.627384
2 -1.523410  1.006072  0.460771 -0.708100
3 -0.562451  0.399061  0.720217 -0.993245
4  0.121739  1.221515  0.156020  0.724815

In [144]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.052629    -0.055735    -0.012032     0.010838
std       0.977011     0.992623     1.027209     1.006113
min      -3.194414    -3.108915    -3.183867    -3.481593
25%      -0.752792    -0.751129    -0.728301    -0.678964
50%      -0.048305    -0.042638     0.001706     0.047905
75%       0.616784     0.601663     0.685885     0.721461
max       3.023720     2.916153     3.189940     2.961194

In [146]:
col=data[2]
col[np.abs(col) > 3]

61    -3.018842
216   -3.183867
263   -3.140963
656    3.082067
684    3.189940
Name: 2, dtype: float64

In [147]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
61   0.581893 -1.116332 -3.018842 -0.298748
86  -0.048478 -3.108915  1.117755 -0.152780
216 -0.274138  1.188742 -3.183867  1.050471
263  1.741426 -2.214074 -3.140963 -1.509976
429 -3.194414  0.077839 -1.733549  0.235425
459  3.023720 -1.105312  0.105141  0.995257
487  0.062528  2.368010  0.452649 -3.481593
656 -0.071320  0.164293  3.082067 -0.516982
684  0.617599 -0.843849  3.189940  0.070978
849 -3.044612 -1.193980  0.862312  1.012656
882  0.069036  0.617561 -1.148738 -3.170292

In [149]:
data[np.abs(data)>3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.052414    -0.055626    -0.011961     0.011490
std       0.976194     0.992294     1.025361     1.004028
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.752792    -0.751129    -0.728301    -0.678964
50%      -0.048305    -0.042638     0.001706     0.047905
75%       0.616784     0.601663     0.685885     0.721461
max       3.000000     2.916153     3.000000     2.961194

In [150]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1  1.0  1.0  1.0 -1.0
2 -1.0  1.0  1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4  1.0  1.0  1.0  1.0